app/Controllers/Pendidikan.php

    public function index()
    {
        $modelPendidikan = new ModelPendidikan();
        $data = [
            'halaman'   => 'Pendidikan',
            'judul'     => 'Pendidikan',
            'subjudul'  => 'View Data',
            'link'      => '/pendidikan/index',
            'tampildata'    => $modelPendidikan->findAll()
---
SELECT *
FROM `pendidikan`